Bookers1/app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)

    if @book.save
      flash[:complete] = "Book was successfully created."
      redirect_to book_path(@book)
    else
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "リーダブルコード"], ["body", "121"], ["created_at", "2020-12-29 18:21:15.097104"], ["updated_at", "2020-12-29 18:21:15.097104"]]
SELECT "books".* FROM "books"

  def update
    @book = Book.find(params[:id])
    if @book.update(book_params)
      flash[:complete] = "Book was successfully updated."
      redirect_to book_path(@book)
    else
      @books = Book.all
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "リーダブルコード"], ["body", "koujo"], ["updated_at", "2020-12-29 13:33:51.366207"], ["id", 12]]
SELECT "books".* FROM "books"